## Production: vpc
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success`
**⚠️ &nbsp; WARNING:** resources will be destroyed by this change!
```terraform
Plan: 2 to add, 0 to change, 2 to destroy
```
<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_security_group.efs_access_sg must be replaced
-/+ resource "aws_security_group" "efs_access_sg" {
      ~ arn                    = "arn:aws:ec2:ca-central-1:414662622316:security-group/sg-033c29e939a74c39b" -> (known after apply)
      ~ description            = "SG for Lambda" -> "SG for EFS" # forces replacement
      ~ egress                 = [] -> (known after apply)
      ~ id                     = "sg-033c29e939a74c39b" -> (known after apply)
      ~ ingress                = [
          - {
              - cidr_blocks      = []
              - description      = "Enables inbound traffic to the Network File System"
              - from_port        = 2049
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = [
                  - "sg-078714ea1197f9904",
                ]
              - self             = false
              - to_port          = 2049
            },
        ] -> (known after apply)
        name                   = "efs_access_sg"
      + name_prefix            = (known after apply)
      ~ owner_id               = "414662622316" -> (known after apply)
      - tags                   = {} -> null
      ~ tags_all               = {} -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # aws_security_group_rule.efs_ingress must be replaced
-/+ resource "aws_security_group_rule" "efs_ingress" {
      ~ id                       = "sgrule-1432948669" -> (known after apply)
      ~ security_group_id        = "sg-033c29e939a74c39b" -> (known after apply) # forces replacement
      ~ security_group_rule_id   = "sgr-00f665de9934ff94f" -> (known after apply)
        # (7 unchanged attributes hidden)
    }

Plan: 2 to add, 0 to change, 2 to destroy.

Changes to Outputs:
  + private_subnet_ids = [
      + "subnet-0eb6100fb7b928309",
      + "subnet-0ff73a0b898dee7d3",
      + "subnet-0bab694b39aeddc27",
    ]

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"
Releasing state lock. This may take a few moments...

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_security_group.efs_access_sg"]
WARN - plan.json - main - Missing Common Tags: ["aws_security_group.lambda_access_sg"]

19 tests, 17 passed, 2 warnings, 0 failures, 0 exceptions

```

</details>
